БухЭксп/Documents/CW_КорректировкаПеревыставления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаПеревыставления</Name>
			<BasedOn>
				<xr:Item>Document.CW_РасходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ПеревыставлениеПоСтавкам</xr:Item>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_Перевыставление</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКорректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговору</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаПеревыставления/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = CW_Настройки.ОсновнаяОрганизация();
	КонецЕсли;
	
	Если ЭтотОбъект.ТолькоПросмотр = Ложь Тогда
		УстановитьПраваДоступа();
	КонецЕсли;

	СформироватьЗаголовокФормыНаСервере();
	
	СтарыйВидОперации = Объект.ВидОперации;
	
	ОбновитьИтогиТабличнойЧасти();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СформироватьЗаголовокФормыНаСервере();
	ПодготовитьДанныеФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьЗаголовокФормыНаСервере()
	
	Заголовок = ?(Объект.ВидОперации=0,"Перевыставление", "Перевыставление по ставкам");  
	
КонецФункции

&НаСервере
Процедура ОбновитьИтогиТабличнойЧасти()
	
	Элементы.СтрокаИтого.Заголовок = 	"ИТОГО по документу: Количество: "+ Формат(Объект.ТаблицаКорректировки.Итог("Количество")	, "ЧДЦ=3; ЧН=0,000")+
												"; Сумма: "	+ Формат(Объект.ТаблицаКорректировки.Итог("Сумма")		, "ЧДЦ=2; ЧН=0,00")+
												"; НДС: "	+ Формат(Объект.ТаблицаКорректировки.Итог("НДС")		, "ЧДЦ=2; ЧН=0,00")+
												"; Всего: "	+ Формат(Объект.ТаблицаКорректировки.Итог("Всего")		, "ЧДЦ=2; ЧН=0,00");
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеФормы()
	
	ЗаполнитьДобавленныеКолонкиТаблиц("ТаблицаКорректировки");
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	//Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

Функция УстановитьПраваДоступа()
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецФункции

Процедура НомерПриИзменении(Элемент)
	СформироватьЗаголовокФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СформироватьЗаголовокФормыНаСервере();
КонецПроцедуры

//ТаблицаКорректировки
&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	МассивГрузоперевозок 	= Объект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	СвойстваГрузоперевозок 	= CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);

	Для каждого СтрокаДокумента Из Объект[ИмяТабличнойЧасти] Цикл

		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаДокумента.Грузоперевозка);
		
		Если СтруктураСвойств <> Неопределено Тогда
			 СтруктураСвойств.Свойство("ПометкаУдаления",СтрокаДокумента.ГрузоперевозкаУдалена);
		Конецесли;
			
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиГрузоперевозкаПриИзменении(Элемент)
	
	ЗаполнитьДобавленныеКолонкиТаблиц("ТаблицаКорректировки");
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииДоговораВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьИтогиТабличнойЧасти();

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиСуммаПриИзменении(Элемент)
	
	ОбновитьИтогиТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДУПриИзменении(Элемент)
	
	ОбновитьИтогиТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДКПриИзменении(Элемент)
	
	ОбновитьИтогиТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДЕПриИзменении(Элемент)
	
	ОбновитьИтогиТабличнойЧасти();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ТаблицаКорректировкиПослеУдаления(Элемент)

	ОбновитьИтогиТабличнойЧасти(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ТаблицаКорректировкиДоговорПриИзменении(Элемент)
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииДоговораВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиКонтрагентПриИзменении(Элемент)
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииКонтрагентаВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры
//ТаблицаКорректировки

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ТаблицаКорректировки.Количество() > 0 тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение,"Табличная часть документа будет очищена. Продолжить?", Режим, 0); 
		
	Иначе
		СтарыйВидОперации = Объект.ВидОперации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ВидОперации = СтарыйВидОперации;
		Возврат;
	КонецЕсли;
	
	Объект.ТаблицаКорректировки.Очистить();
	
	СтарыйВидОперации = Объект.ВидОперации;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти 

//Заполнение табличной части документа
&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)

	ПараметрыЗаполнения = ПолучитьПараметрыЗаполненияТабличнойЧасти("ТаблицаКорректировки"); 
	CW_ЗаполнениеДокументовКлиент.ПередНачаломЗаполненияДокумента(ПараметрыЗаполнения);

КонецПроцедуры   

&НаКлиенте
Функция ПолучитьПараметрыЗаполненияТабличнойЧасти(Знач ИмяТабличнойЧасти, Знач ПоказатьФормуОтбора=Истина)
	
	ДатаСреза 	= ?(Объект.Дата =Дата(1,1,1), ТекущаяДата(), Объект.Дата); 

	Если Объект.ВидОперации = 0 Тогда
		ИмяМакета = "ЗаполнитьПоПеревыставлению"
	Иначе
		ИмяМакета = "ЗаполнитьПоПеревыставлениюПоСтавкам"
	КонецЕсли;
	
	ДополлнительныеПараметры = Новый Структура;
	ДополлнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
  	Оповещение 	= Новый ОписаниеОповещения("ЗаполнитьТабличнюЧасть", ЭтотОбъект, ДополлнительныеПараметры);
	
	ПараметрыЗаполнения = CW_ЗаполнениеДокументовКлиент.НоваяСтруктураПараметровЗаполнения(); 
	
	ПараметрыЗаполнения.Отбор.Вставить("Договор.Организация", Объект.Организация);

	ПараметрыЗаполнения.ПараметрыДанных.Вставить("Период", ДатаСреза); 
	
	ПараметрыЗаполнения.ПустаяСсылка 		= ПредопределенноеЗначение("Документ.CW_КорректировкаПеревыставления.ПустаяСсылка");
	ПараметрыЗаполнения.Форма 				= ЭтаФорма;
	ПараметрыЗаполнения.ИмяТабличнойЧасти 	= ИмяТабличнойЧасти;
	ПараметрыЗаполнения.ИмяМакета 			= ИмяМакета;
	ПараметрыЗаполнения.ПоказатьФормуОтбора = ПоказатьФормуОтбора;
	ПараметрыЗаполнения.Оповещение 			= Оповещение;
	ПараметрыЗаполнения.КонтрольЗаполненияРеквизитовФормы = Истина;
	
	Возврат ПараметрыЗаполнения;  
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТабличнюЧасть(Результат, ДополлнительныеПараметры) Экспорт
	
	Если Результат = Неопределено 
		или Не ЭтоАдресВременногоХранилища(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьТабличннуюЧастьНаСервере(Результат, ДополлнительныеПараметры);
	
	Если Не ПустаяСтрока(РезультатЗаполнения) Тогда
		ПоказатьПредупреждение(, РезультатЗаполнения);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьТабличннуюЧастьНаСервере(АдресТаблицы, ДополлнительныеПараметры)  
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Если ТипЗнч(ТаблицаЗначений) = Тип("ТаблицаЗначений") Тогда 
		Если ТаблицаЗначений.Количество() = 0 Тогда
			Возврат "Не удалось получить данные для заполнения!";
		КонецЕсли;
		
		Объект[ДополлнительныеПараметры.ИмяТабличнойЧасти].Загрузить(ТаблицаЗначений);  
		ОбновитьИтогиТабличнойЧасти();
	Иначе
		Возврат "Не удалось заполнить таблицу документа!";
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции 
//Заполнение табличной части документа


//Групповое Изменение Реквизитов Строки
&НаКлиенте
Процедура ГрупповоеИзменениеРеквизитовСтроки(Команда)  
	
	ВыделенныеСтроки = Элементы.ТаблицаКорректировки.ВыделенныеСтроки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьРедактированиеРеквизитовСтроки", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыРедактирования = Новый Структура; 
	ПараметрыРедактирования.Вставить("Ссылка", ПредопределенноеЗначение("Документ.CW_КорректировкаПеревыставления.ПустаяСсылка"));
	
	ОткрытьФорму("ОбщаяФорма.CW_ГрупповоеИзменениеРеквизитовСтрокДокументов", ПараметрыРедактирования, ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьРедактированиеРеквизитовСтроки(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПродолжитьРедактированиеРеквизитовСтрокиНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры  

&НаСервере
Процедура ПродолжитьРедактированиеРеквизитовСтрокиНаСервере(Результат, ДополнительныеПараметры)
	
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		
		СтрокаТаблицы  = Объект.ТаблицаКорректировки.НайтиПоИдентификатору(ИдентификаторСтроки); 
		
		Для Каждого КлючЗначение из Результат Цикл
			СтрокаТаблицы[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;
		
	КонецЦикла;  
	
	ОбновитьИтогиТабличнойЧасти();
	
КонецПроцедуры
//Групповое Изменение Реквизитов Строки
